DARTS_Performance/user-files/resources/getcourtlogwithtoken/0000_request.dat

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:com="http://com.synapps.mojdarts.service.com">
	<soapenv:Header>
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsse:BinarySecurityToken QualificationValueType="http://schemas.emc.com/documentum#ResourceAccessToken"
				xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="RAD">eyJhbGciOiJSUzI1NiIsImtpZCI6Ilg1ZVhrNHh5b2pORnVtMWtsMll0djhkbE5QNC1jNTdkTzZRR1RWQndhTmsiLCJ0eXAiOiJKV1QifQ.eyJpZHAiOiJMb2NhbEFjY291bnQiLCJvaWQiOiI3MzJkNDg1MS04OWVkLTQ0M2QtOTdjMi0wMDhlYWI0ZWNjNzMiLCJzdWIiOiI3MzJkNDg1MS04OWVkLTQ0M2QtOTdjMi0wMDhlYWI0ZWNjNzMiLCJnaXZlbl9uYW1lIjoiVmlRIiwiZmFtaWx5X25hbWUiOiJFeHRlcm5hbCB1c2VyIiwidGZwIjoiQjJDXzFfcm9wY19kYXJ0c19zaWduaW4iLCJzY3AiOiJEYXJ0cy5FeHRlcm5hbFNlcnZpY2UiLCJhenAiOiIzNjNjMTFjYi00OGI5LTQ0YmYtOWQwNi05YTM5NzNmNmY0MTMiLCJ2ZXIiOiIxLjAiLCJpYXQiOjE3MTM4NjU2MzMsImF1ZCI6IjM2M2MxMWNiLTQ4YjktNDRiZi05ZDA2LTlhMzk3M2Y2ZjQxMyIsImV4cCI6MTcxMzg2OTIzMywiaXNzIjoiaHR0cHM6Ly9obWN0c3N0Z2V4dGlkLmIyY2xvZ2luLmNvbS84YjE4NWY4Yi02NjVkLTRiYjMtYWY0YS1hYjdlZTYxYjkzMzQvdjIuMC8iLCJuYmYiOjE3MTM4NjU2MzN9.BLnaseWShTPKpORYDUIwq_Ac4Rtmn6pTrGPrSru_7QaJh4OYXM5861OVM5E2UbBTtkx_bX42HLRIl7Ub5xRF19CxVBbajMH52SNT7cspVl_F9PYpmuZkg1V97uqLcjNFZRe6G04fG-HnptNCPJV328oHhw3m_MWhAMo4OfTgGfNt_kwMoBFMJBL9Mfyqs4YVu1nbCoiMAi8I98Ujkrt8IhGGKnNzQN6_EjgTFA4pBNDCGm237x5kyBGsTX1S7HkepqUgYj0wKT9dt8VRQEM58aqVmvAvgIgQKuqHUoP8l5VPV0I4ecY_hScooeyF2B0RlB9X_kTjOJqrcFm1-Rmnhw</wsse:BinarySecurityToken>
		</wsse:Security>
	</soapenv:Header>
	<soapenv:Body>
		<addLogEntry
			xmlns="http://com.synapps.mojdarts.service.com">
			<document
				xmlns="">&lt;log_entry Y=&quot;2023&quot; M=&quot;01&quot; D=&quot;01&quot; H=&quot;10&quot; MIN=&quot;00&quot; S=&quot;00&quot;&gt;&lt;courthouse&gt;SWANSEA&lt;/courthouse&gt;&lt;courtroom&gt;CR1&lt;/courtroom&gt;&lt;case_numbers&gt;&lt;case_number&gt;CASE000001&lt;/case_number&gt;&lt;/case_numbers&gt;&lt;text&gt;THISISEVENTTEXT&lt;/text&gt;&lt;/log_entry&gt;
  
			</document>
		</addLogEntry>
	</soapenv:Body>
</soapenv:Envelope>