DARTS_Performance/user-files/resources/getcasessoapuser/0000_request.dat

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
   <s:Header>
      <ServiceContext token="temporary/127.0.0.1-1694086218480-789961425" xmlns="http://context.core.datamodel.fs.documentum.emc.com/">
         <Identities xsi:type="RepositoryIdentity" userName="xhibit_user" password="Password@1" repositoryName="moj_darts" domain="" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
         <RuntimeProperties/>
      </ServiceContext>
   </s:Header>
   <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      <ns2:getCases xmlns:ns2="http://com.synapps.mojdarts.service.com">
         <courthouse>Bristol</courthouse>
         <courtroom>1</courtroom>
         <date>2023-11-29</date>
      </ns2:getCases>
   </s:Body>
</s:Envelope>