DARTS_Performance/results/addcasesoapusersimulation-20240219145941792/simulation.log

RUN	DartsSoap.AddCaseSOAPUserSimulation	addcasesoapusersimulation	1708354781792	8	3.9.5
USER	DARTS - GateWay - Soap - AddCase :POST	START	1708354782377
ERROR	DARTS - GateWay - Soap - AddCase - User: Failed to build request: Failed to build request: j.n.f.InvalidPathException: Illegal char <<> at index 0: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <ServiceContext token="temporary/127.0.0.1-1694086218480-789961425" xmlns="http://context.core.datamodel.fs.documentum.emc.com/">
      <Identities xsi:type="RepositoryIdentity" userName="xhibit_user" password="Password@1" repositoryName="moj_darts" domain="" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
      <RuntimeProperties/>
    </ServiceContext>
  </s:Header>
  <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <ns2:addCase xmlns:ns2="http://com.synapps.mojdarts.service.com">
      <document><![CDATA[<case type="1" id="U20231129-1733"><courthouse>PerfCourtHouse04</courthouse><courtroom>PerfCourtroom01</courtroom><defendants><defendant>VmshTgLCjs</defendant><defendant>7gthbqID3Q</defendant></defendants><judges><judge>Mr Judge</judge><judge>Mrs wUyuf5MVsY</judge></judges><prosecutors><prosecutor>Mr Prosecutor</prosecutor><prosecutor>Mrs Prosecutor</prosecutor></prosecutors></case>]]></document>
    </ns2:addCase>
  </s:Body>
</s:Envelope> 	1708354782401
GROUP	AddCase SOAP Request Group	1708354782381	1708354782405	0	KO
USER	DARTS - GateWay - Soap - AddCase :POST	END	1708354782408
